Revit 2024 API
ScheduleDefinition.GetSortGroupFieldCount Method
 Gets the number of sorting/grouping fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int GetSortGroupFieldCount()
Visual Basic
Public Function GetSortGroupFieldCount As Integer
Visual C++
public:
int GetSortGroupFieldCount()
Return Value
 The number of sorting/grouping fields.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace